english_letter = {'A':1, 'B':3, 'C':3, 'D':2, 'E':1, 'F':4, 'G':2, 'H':4, 'I':1, 'J':8, 'K':5, 'L':1, 'M':3, 'N':1, 'O':1, 'P':3, 'Q':10, 'R':1, 'S':1, 'T':1, 'U':1, 'V':4, 'W':4, 'X':8, 'Y':4, 'Z':10,
                  'a':1, 'b':3, 'c':3, 'd':2, 'e':1, 'f':4, 'g':2, 'h':4, 'i':1, 'j':8, 'k':5, 'l':1, 'm':3, 'n':1, 'o':1, 'p':3, 'q':10, 'r':1, 's':1, 't':1, 'u':1, 'v':4, 'w':4, 'x':8, 'y':4, 'z':10,}
russian_letter = {'А':1, 'Б':3, 'В':1, 'Г':3, 'Д':2, 'Е':1, 'Ё':3, 'Ж':5, 'З':5, 'И':1, 'Й':4, 'К':2, 'Л':2, 'М':2, 'Н':1, 'О':1, 'П':2, 'Р':1, 'С':1, 'Т':1, 'У':2, 'Ф':10, 'Х':5, 'Ц':5, 'Ч':5, 'Ш':8, 'Щ':10, 'Ь':3, 'Ы':4, 'Ъ':10, 'Э':8, 'Ю':8, 'Я':3,
                  'а':1, 'б':3, 'в':1, 'г':3, 'д':2, 'е':1, 'ё':3, 'ж':5, 'з':5, 'и':1, 'й':4, 'к':2, 'л':2, 'м':2, 'н':1, 'о':1, 'п':2, 'р':1, 'с':1, 'т':1, 'у':2, 'ф':10, 'х':5, 'ц':5, 'ч':5, 'ш':8, 'щ':10, 'ь':3, 'ы':4, 'ъ':10, 'э':8, 'ю':8, 'я':3,}

word = input()

english_sum = 0
russian_sum = 0

for letter in word:
    if letter.upper() in english_letter:
        english_sum += english_letter[letter.upper()]
    if letter.upper() in russian_letter:
        russian_sum += russian_letter[letter.upper()]

print(english_sum)
print(russian_sum)